---
title: FaceDetailNode
classe: Autodesk.Revit.DB.FaceDetailNode
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.RenderNode
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# FaceDetailNode

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `LineProperties LineProperties { get; }` | `faceDetailNode.LineProperties` | LineProperties |
| `Transform GetInstanceTransform()` | `faceDetailNode.GetInstanceTransform()` | Transform |
| `Transform GetLinkTransform()` | `faceDetailNode.GetLinkTransform()` | Transform |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```